---
kind: method
id: M:Autodesk.Revit.DB.FailureDefinitionAccessor.Dispose
source: html/5767ff46-0c65-011e-9349-c83c1519c36b.htm
---
# Autodesk.Revit.DB.FailureDefinitionAccessor.Dispose Method

Releases all resources used by the FailureDefinitionAccessor

## Syntax (C#)
```csharp
public void Dispose()
```